#+TITLE: Emacs Configuration

** gnus

Sanitized version of .authinfo.gpg for Gmail IMAP and SMTP.

#+begin_src sh :results output
gpg2 --batch -d ~/.authinfo.gpg | awk '/\.gmail\.com/{$4="EMAIL";$6="PASSWORD";print}'
#+end_src

#+RESULTS:
: machine imap.gmail.com login EMAIL password PASSWORD port imaps
: machine smtp.gmail.com login EMAIL password PASSWORD port 587

#+begin_src emacs-lisp
(use-package gnus
  :config
  (progn
    ;; Gmane
    (setq gnus-select-method
          '(nntp "news.gmane.org"))

    (add-to-list 'gnus-secondary-select-methods
                 '(nnimap "gmail"
                          (nnimap-address "imap.gmail.com")
                          (nnimap-server-port 993)
                          (nnimap-stream ssl)))

    ;; Do not take over the entire frame
    (setq gnus-use-full-window nil)

    (setq gnus-always-read-dribble-file t)

    ;; ;; Debugging
    ;; (setq imap-log t)

    (setq gnus-posting-styles
          '((".*"
             (address "svend@ciffer.net"))
            ("uw" (address "svends@uw.edu")
             ("Bcc" "svends@uw.edu"))
            ("whitepages"
             (address "ssorensen@whitepages.com"))))))
#+end_src

